## "Простая обработка файла"

### Задание

Дан файл [data/numbers.txt](data/numbers.txt) с целыми числами. 

Найдите сумму всех чисел в файле и их среднеарифметическое.

### Формат входных данных

Дан текстовый файл. В каждой строке файла записано целое число.

### Формат выходных данных

Вывести сумму всех чисел и среднеарифметическое этих чисел.

### Решение задачи

f = open(path, "r")
sum_numbers = 0
len_numbers = 0
# Переменная для подсчета суммы
# В переменную line считываем строку за стройкой из файла(f)
for line in f:
    sum_numbers = int(line) + sum_numbers
    len_numbers = int(line)-int(line) +1 + len_numbers
print(f"Сумма чисел = {sum_numbers}")
print(f"Среднеарифметическое = {sum_numbers/len_numbers}")
```

---

### Подсказки

<details>
<summary>Подсказка-1</summary>
Работайте с файлом построчно:

Прочитали строку --> Преобразовали к int'у --> Добавили к общей сумме
</details>

<details>
<summary>Подсказка-2</summary>
Для подсчета количества создайте переменную счетчик и увеличивайте ее на единицу, считывая очередное значение из файла
</details>
