# Дан список имен.
# Выведите все имена в одну строку через запятую

names = ["Иван", "Ирина", "Вячеслав", "Василий", "Петр"]
for name in names:
    name+','
print(names)

# Пример вывода:
# Иван, Ирина, Вячеслав, Василий, Петр
